#+title:     HTML
#+author:    Logan Barnett
#+email:     logustus@gmail.com
#+date:      <2020-06-15 Mon>
#+language:  en
#+file_tags:
#+tags:

* indentation

By default, =html-mode= seems to start with tabs as the preferred indentation
character.  Change it to spaces.

Keep in mind that =dtrt-indent= can override this value.  Use
=dtrt-indent-diagnosis= to see why it's getting set to one or the other.

#+name: config/html-indentation-use-spaces
#+begin_src emacs-lisp :results none :tangle no
(setq-local indent-tabs-mode nil)
#+end_src

* file templates
** default
Set the default file template for HTML.

#+name: config/html-set-file-templates
#+begin_src emacs-lisp :results none :tangle no
(on-doom
 (set-file-template! 'web-mode :trigger "new-html")
 (set-file-template! 'mhtml-mode :trigger "new-html")
 )
#+end_src
*** TODO move HTML file templates to yasnippet

I probably have the same file twice here because I want to use it twice. I think
yasnippets can refer to each other, or I can use symlinks. Either way, using
this with =use-package= is a poor idea I think, and it's causing startup issues.

* tidy

The built-in =tidy= for MacOS dates back to 2006!

#+begin_src shell :tangle no
tidy --version
#+end_src

#+RESULTS:
: HTML Tidy for Apple macOS version 5.6.0

Actually that's the correct version, post-install of =tidy-html5= (find the
installation conducted in [[file:../html-tools-install.sh]]).

Run from my prompt gives me a different answer, but even the other version is
pretty old. Here's the one using my terminal:

#+begin_example shell
$ tidy --version
HTML Tidy for Mac OS X released on 31 October 2006 - Apple Inc. build 16.4
#+end_example

Since Emacs seems to find it correctly I don't think there's anything to change.

* stitch

Using =use-package= here actually runs =mhtml-mode= and that causes startup
issues.  Just disable it for now.

#+begin_src emacs-lisp :results none :noweb yes
(use-package "mhtml-mode"
  :init
  <<config/html-set-file-templates>>
  :config
  <<config/html-indentation-use-spaces>>
  )
#+end_src
